src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРасчета</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/КадроваяИсторияСотрудников/КадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	ЗаполнитьАвтоматическиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	Объект.Начисления.Очистить();
	
	ДатаНачала = НачалоМесяца(Объект.ПериодНачисления);
	ДатаОкончания = КонецМесяца(Объект.ПериодНачисления);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КИС_НачалоПериода.Период < &ДатаНачала
	|			ТОГДА &ДатаНачала
	|		ИНАЧЕ КИС_НачалоПериода.Период
	|	КОНЕЦ КАК Период,
	|	КИС_НачалоПериода.Сотрудник КАК Сотрудник,
	|	КИС_НачалоПериода.ГрафикРаботы КАК ГрафикРаботы,
	|	КИС_НачалоПериода.Оклад КАК Оклад,
	|	КИС_НачалоПериода.Работает КАК Работает
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаНачала, ) КАК КИС_НачалоПериода
	|ГДЕ
	|	КИС_НачалоПериода.Работает = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КИС.Период,
	|	КИС.Сотрудник,
	|	КИС.ГрафикРаботы,
	|	КИС.Оклад,
	|	КИС.Работает
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КИС
	|ГДЕ
	|	КИС.Период >= &ДатаНачала
	|	И КИС.Период <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Сотрудник КАК Сотрудник,
	|	ВТ_Данные.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_Данные.Оклад КАК Оклад,
	|	ВТ_Данные.Период КАК ДатаНачала,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СледующаяЗапись.Период <= &ДатаОкончания
	|				ТОГДА ВЫБОР
	|						КОГДА СледующаяЗапись.Работает = ИСТИНА
	|							ТОГДА ДОБАВИТЬКДАТЕ(СледующаяЗапись.Период, ДЕНЬ, -1)
	|						ИНАЧЕ СледующаяЗапись.Период
	|					КОНЕЦ
	|			ИНАЧЕ &ДатаОкончания
	|		КОНЕЦ) КАК ДатаОкончания
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Данные КАК СледующаяЗапись
	|		ПО ВТ_Данные.Сотрудник = СледующаяЗапись.Сотрудник
	|			И ВТ_Данные.Период < СледующаяЗапись.Период
	|ГДЕ
	|	ВТ_Данные.Работает = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Сотрудник,
	|	ВТ_Данные.Оклад,
	|	ВТ_Данные.Период,
	|	ВТ_Данные.ГрафикРаботы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ГрафикРаботы = Выборка.ГрафикРаботы;
		//В ТЗ не указано, что ВидРасчета заполняется, поэтому его пропускаем
		НоваяСтрока.ДатаНачала = Выборка.ДатаНачала;
		НоваяСтрока.ДатаОкончания = Выборка.ДатаОкончания;
		НоваяСтрока.ПоказательРасчета = Выборка.Оклад;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
